MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL26Z128VFT4/mcu.h
#define SRVCOP                        0x00007F80      // Service COP Register


//*****************************************************************************
//
// The following are defines for the bit fields in the SMC_PMPROT register.
//
//*****************************************************************************

#define AVLP                          0x00000020      // Allow Very-Low-Power Modes
#define ALLS                          0x00000008      // Allow Low-Leakage Stop Mode
#define AVLLS                         0x00000002      // Allow Very-Low-Leakage Stop Mode


//*****************************************************************************
//
// The following are defines for the bit fields in the SMC_PMCTRL register.
//
//*****************************************************************************

#define RUNM                          0x000000C0      // Run Mode Control
#define STOPA                         0x00000008      // Stop Aborted
#define STOPM                         0x0000001C      // Stop Mode Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SMC_STOPCTRL register.
//
//*****************************************************************************

#define PSTOPO                        0x00000180      // Partial Stop Option
#define PORPO                         0x00000020      // POR Power Option
#define VLLSM                         0x0000001C      // VLLS Mode Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SMC_PMSTAT register.
//
//*****************************************************************************

#define PMSTAT                        0x00001FC0      // 000_0001: Current power mode is RUN;; 000_0010: Current power mode is STOP;; 000_0100: Current power mode is VLPR;; 000_1000: Current power mode is VLPW;; 001_0000: Current power mode is VLPS;; 010_0000: Current power mode is LLS;; 100_0000: Current power mode is VLLS


//*****************************************************************************
//
// The following are defines for the bit fields in the PMC_LVDSC1 register.
//
//*****************************************************************************

#define LVDF                          0x00000080      // Low-Voltage Detect Flag
#define LVDACK                        0x00000040      // Low-Voltage Detect Acknowledge
#define LVDIE                         0x00000020      // Low-Voltage Detect Interrupt Enable
#define LVDRE                         0x00000010      // Low-Voltage Detect Reset Enable
#define LVDV                          0x00000006      // Low-Voltage Detect Voltage Select


//*****************************************************************************
//
// The following are defines for the bit fields in the PMC_LVDSC2 register.
//
//*****************************************************************************

#define LVWF                          0x00000080      // Low-Voltage Warning Flag
#define LVWACK                        0x00000040      // Low-Voltage Warning Acknowledge
#define LVWIE                         0x00000020      // Low-Voltage Warning Interrupt Enable
#define LVWV                          0x00000006      // Low-Voltage Warning Voltage Select


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PE1 register.
//
//*****************************************************************************

#define WUPE3                         0x00000180      // Wakeup Pin Enable For LLWU_P3
#define WUPE2                         0x00000060      // Wakeup Pin Enable For LLWU_P2
#define WUPE1                         0x00000018      // Wakeup Pin Enable For LLWU_P1
#define WUPE0                         0x00000006      // Wakeup Pin Enable For LLWU_P0


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PE2 register.
//
//*****************************************************************************

#define WUPE7                         0x00000180      // Wakeup Pin Enable For LLWU_P7
#define WUPE6                         0x00000060      // Wakeup Pin Enable For LLWU_P6
#define WUPE5                         0x00000018      // Wakeup Pin Enable For LLWU_P5
#define WUPE4                         0x00000006      // Wakeup Pin Enable For LLWU_P4


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PE3 register.
//
//*****************************************************************************

#define WUPE11                        0x00000180      // Wakeup Pin Enable For LLWU_P11
#define WUPE10                        0x00000060      // Wakeup Pin Enable For LLWU_P10
#define WUPE9                         0x00000018      // Wakeup Pin Enable For LLWU_P9
#define WUPE8                         0x00000006      // Wakeup Pin Enable For LLWU_P8


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_PE4 register.
//
//*****************************************************************************

#define WUPE15                        0x00000180      // Wakeup Pin Enable For LLWU_P15
#define WUPE14                        0x00000060      // Wakeup Pin Enable For LLWU_P14
#define WUPE13                        0x00000018      // Wakeup Pin Enable For LLWU_P13
#define WUPE12                        0x00000006      // Wakeup Pin Enable For LLWU_P12


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_ME register.
//
//*****************************************************************************

#define WUME7                         0x00000080      // Wakeup Module Enable For Module 7
#define WUME6                         0x00000040      // Wakeup Module Enable For Module 6
#define WUME5                         0x00000020      // Wakeup Module Enable For Module 5
#define WUME4                         0x00000010      // Wakeup Module Enable For Module 4
#define WUME3                         0x00000008      // Wakeup Module Enable For Module 3
#define WUME2                         0x00000004      // Wakeup Module Enable For Module 2
#define WUME1                         0x00000002      // Wakeup Module Enable for Module 1
#define WUME0                         0x00000001      // Wakeup Module Enable For Module 0


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_F1 register.
//
//*****************************************************************************

#define WUF7                          0x00000080      // Wakeup Flag For LLWU_P7
#define WUF6                          0x00000040      // Wakeup Flag For LLWU_P6
#define WUF5                          0x00000020      // Wakeup Flag For LLWU_P5
#define WUF4                          0x00000010      // Wakeup Flag For LLWU_P4
#define WUF3                          0x00000008      // Wakeup Flag For LLWU_P3
#define WUF2                          0x00000004      // Wakeup Flag For LLWU_P2
#define WUF1                          0x00000002      // Wakeup Flag For LLWU_P1
#define WUF0                          0x00000001      // Wakeup Flag For LLWU_P0


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_F2 register.
//
//*****************************************************************************

#define WUF15                         0x00000080      // Wakeup Flag For LLWU_P15
#define WUF14                         0x00000040      // Wakeup Flag For LLWU_P14
#define WUF13                         0x00000020      // Wakeup Flag For LLWU_P13
#define WUF12                         0x00000010      // Wakeup Flag For LLWU_P12
#define WUF11                         0x00000008      // Wakeup Flag For LLWU_P11
#define WUF10                         0x00000004      // Wakeup Flag For LLWU_P10
#define WUF9                          0x00000002      // Wakeup Flag For LLWU_P9
#define WUF8                          0x00000001      // Wakeup Flag For LLWU_P8


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_F3 register.
//
//*****************************************************************************

#define MWUF7                         0x00000080      // Wakeup flag For module 7
#define MWUF6                         0x00000040      // Wakeup flag For module 6
#define MWUF5                         0x00000020      // Wakeup flag For module 5
#define MWUF4                         0x00000010      // Wakeup flag For module 4
#define MWUF3                         0x00000008      // Wakeup flag For module 3
#define MWUF2                         0x00000004      // Wakeup flag For module 2
#define MWUF1                         0x00000002      // Wakeup flag For module 1
#define MWUF0                         0x00000001      // Wakeup flag For module 0


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_FILT1 register.
//
//*****************************************************************************

#define FILTF                         0x00000080      // Filter Detect Flag
#define FILTE                         0x000000C0      // Digital Filter On External Pin
#define FILTSEL                       0x00000078      // Filter Pin Select


//*****************************************************************************
//
// The following are defines for the bit fields in the LLWU_FILT2 register.
//
//*****************************************************************************

#define FILTF                         0x00000080      // Filter Detect Flag
#define FILTE                         0x000000C0      // Digital Filter On External Pin
#define FILTSEL                       0x00000078      // Filter Pin Select


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_POSITION register.
//
//*****************************************************************************

#define Trace Packet Address Pointer[28:0]0xFFFFFFF80000000      // POINTER
#define WRAP                          0x00000004      // This field is set to 1 automatically when the POINTER value wraps as determined by the MTB_MASTER[MASK] field in the MASTER Trace Control Register.;; A debug agent might use the WRAP field to determine whether the trace information above and below the pointer address is valid.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_MASTER register.
//
//*****************************************************************************

#define Main Trace Enable             0x80000000      // EN
#define Halt Request                  0x00000200      // HALTREQ
#define RAM Privilege                 0x00000100      // RAMPRIV
#define Special Function Register Write Privilege0x00000080      // SFRWPRIV
#define Trace Stop Input Enable       0x00000040      // TSTOPEN
#define Trace Start Input Enable      0x00000020      // TSTARTEN
#define Mask                          0x000001F0      // MASK


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_FLOW register.
//
//*****************************************************************************

#define WATERMARK[28:0]               0xFFFFFFF80000000      // WATERMARK
#define AUTOHALT                      0x00000002      // If this field is 1 and WATERMARK is equal to MTB_POSITION[POINTER], then MTB_MASTER[HALTREQ] is automatically set to 1.;; If the DBGEN signal is HIGH, the MTB asserts this halt request to the Cortex-M0+ processor by asserting the EDBGRQ signal.
#define AUTOSTOP                      0x00000001      // If this field is 1 and WATERMARK is equal to MTB_POSITION[POINTER], then MTB_MASTER[EN] is automatically set to 0.;; This stops tracing.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_BASE register.
//
//*****************************************************************************

#define BASEADDR                      0x7FFFFFFF80000000      // This value is defined with a hardwired signal and the expression: 0x2000_0000 - (RAM_Size/4).;; For example, if the total RAM capacity is 16 KB, this field is 0x1FFF_F000.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_MODECTRL register.
//
//*****************************************************************************

#define MODECTRL                      0x7FFFFFFF80000000      // Hardwired to 0x0000_0000.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_TAGSET register.
//
//*****************************************************************************

#define TAGSET                        0x7FFFFFFF80000000      // Hardwired to 0x0000_0000.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_TAGCLEAR register.
//
//*****************************************************************************

#define TAGCLEAR                      0x7FFFFFFF80000000      // Hardwired to 0x0000_0000.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_LOCKACCESS register.
//
//*****************************************************************************

#define LOCKACCESS                    0x7FFFFFFF80000000      // Hardwired to 0x0000_0000.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_LOCKSTAT register.
//
//*****************************************************************************

#define LOCKSTAT                      0x7FFFFFFF80000000      // Hardwired to 0x0000_0000.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_AUTHSTAT register.
//
//*****************************************************************************

#define BIT2                          0x00000018      // Connected to NIDEN or DBGEN signal.
#define BIT0                          0x00000006      // Connected to DBGEN.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_DEVICEARCH register.
//
//*****************************************************************************

#define DEVICEARCH                    0x7FFFFFFF80000000      // Hardwired to 0x4770_0A31.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_DEVICECFG register.
//
//*****************************************************************************

#define DEVICECFG                     0x7FFFFFFF80000000      // Hardwired to 0x0000_0000.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_DEVICETYPID register.
//
//*****************************************************************************

